'''
Программа запрашивает у пользователя строку чисел, разделенных пробелом.
При нажатии Enter должна выводиться сумма чисел.
Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
Но если вместо числа вводится специальный символ, выполнение программы завершается.
Если специальный символ введен после нескольких чисел,
то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.
'''


# Запрос и ввод строки чисел
def in_str_num():
    in_string = input('Введите числа разделяя их пробелом для сложения')
    in_list = in_string.split()

    pass


# Сумма чисел в списке
def sum_nums(sum_list):
    pass


# Зацикленность или выход
def inp_or_ex():
    pass


global a = int_str_num()
